       01  GRID.
           05 GRID-ROW OCCURS 140 TIMES.
               10 GRID-COL OCCURS 140 TIMES.
                   15  GRID-CELL         PIC X(1).
       01  GRID-SIZE PIC 9(3) USAGE COMP VALUE 0.
