       01  C-INFINITY                        CONSTANT 999999.
       01  C-TOP     PIC 9(1) VALUE 1.
       01  C-RIGHT   PIC 9(1) VALUE 2.
       01  C-BOTTOM  PIC 9(1) VALUE 3.
       01  C-LEFT    PIC 9(1) VALUE 4.
